ezois_ka/oooezoiskaobmen/src/AccumulationRegisters/НДСЗаписиКнигиПокупок/НДСЗаписиКнигиПокупок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>НДСЗаписиКнигиПокупок</name>
  <comment>НДС. Записи книги покупок</comment>
  <registerType>Turnovers</registerType>
  <resources>
    <name>СуммаБезНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокументаОплаты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокументаОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодВидаОперации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегламентнаяОперация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОтгрузки</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.АктВыполненныхРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДеятельностиНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>НДСУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПродавцомВыступаетОрганизация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСчетаФактуры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСчетаФактуры</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерИсправленияСчетаФактуры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИсправленияСчетаФактуры</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетФактура</name>
    <type>
      <types>DefinedType.ОснованиеЗаписиКнигиПокупок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЦенности</name>
    <type>
      <types>EnumRef.ВидыЦенностей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетУчетаНДС</name>
    <comment>Субсчет 19 счета, на котором учитывается НДС</comment>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументОплаты</name>
    <type>
      <types>DocumentRef.ЗаписьКнигиПокупок</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ПервичныйДокумент</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ВводОстатковДенежныхСредств</types>
      <types>DocumentRef.ОперацияБух</types>
      <types>DocumentRef.ВводОстатков</types>
      <types>DocumentRef.ВводОстатковНДСПредъявленного</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.КорректировкаПриобретения</types>
      <types>DocumentRef.ПриобретениеУслугПрочихАктивов</types>
      <types>DocumentRef.КорректировкаЗадолженности</types>
      <types>DocumentRef.ВозвратТоваровМеждуОрганизациями</types>
      <types>DocumentRef.ВводОстатковТоваров</types>
      <types>DocumentRef.ВзаимозачетЗадолженности</types>
      <types>DocumentRef.ВводОстатковВзаиморасчетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Событие</name>
    <type>
      <types>EnumRef.СобытияПоНДСПокупки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаписьДополнительногоЛиста</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КорректируемыйПериод</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорКонтрагента</name>
    <comment>Договор контрагента (для СФ на аванс, нал.агента по ст. 161.5 НК РФ)</comment>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>CatalogRef.ДоговорыАренды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИсправленныйСчетФактура</name>
    <type>
      <types>DocumentRef.СчетФактураПолученныйАванс</types>
      <types>DocumentRef.СчетФактураВыданныйАванс</types>
      <types>DocumentRef.КорректировкаРеализации</types>
      <types>DocumentRef.КорректировкаПриобретения</types>
      <types>DocumentRef.СчетФактураВыданный</types>
      <types>DocumentRef.СчетФактураПолученный</types>
      <types>DocumentRef.СчетФактураПолученныйНалоговыйАгент</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ezois_ka/oooezoiskaobmen/src/Documents/СчетФактураВыданныйАванс/СчетФактураВыданныйАванс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СчетФактураВыданныйАванс</name>
  <basedOn>Document.ПоступлениеБезналичныхДенежныхСредств</basedOn>
  <basedOn>Document.ПриходныйКассовыйОрдер</basedOn>
  <basedOn>Document.СчетФактураПолученныйАванс</basedOn>
  <registerRecords>AccumulationRegister.ДвиженияПоНДС</registerRecords>
  <registerRecords>InformationRegister.ОтражениеДокументовВРеглУчете</registerRecords>
  <registerRecords>AccumulationRegister.НДСАвансыПолученные</registerRecords>
  <registerRecords>AccumulationRegister.ФактическиеДанныеБюджетирования</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.НДСЗаписиКнигиПродаж</registerRecords>
  <registerRecords>AccumulationRegister.НДСЗаписиКнигиПокупок</registerRecords>
  <registerRecords>InformationRegister.ЖурналУчетаСчетовФактур</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.ОснованиеСчетФактураВыданныйАванс</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПлатежноРасчетногоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПлатежноРасчетногоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаПлатежноРасчетныеДокументы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыставленВЭлектронномВиде</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыставления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодВидаОперации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоОтбораАванса</name>
    <type>
      <types>EnumRef.ПорядокРегистрацииСчетовФактурНаАванс</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.ОтветственныеЛицаОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйБухгалтер</name>
    <type>
      <types>CatalogRef.ОтветственныеЛицаОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетФактураОснование</name>
    <type>
      <types>DocumentRef.СчетФактураВыданныйАванс</types>
    </type>
  </attributes>
  <attributes>
    <name>Исправление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерИсправления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ИННКонтрагента</name>
    <type>
      <types>DefinedType.ИНН</types>
    </type>
  </attributes>
  <attributes>
    <name>КППКонтрагента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторГосКонтракта</name>
    <comment>Идентификатор государственного контракта, договора (соглашения)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Корректировочный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СводныйКорректировочный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКорректировкаЖурналаСФ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолученияАванса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКомиссии</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Авансы</name>
    <attributes>
      <name>НаправлениеДеятельности</name>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураНабора</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНабора</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗапасов</name>
      <type>
        <types>EnumRef.ТипыЗапасов</types>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсходныйСчетФактура</name>
      <type>
        <types>DocumentRef.СчетФактураВыданныйАванс</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРасчетов</name>
      <type>
        <types>CatalogRef.ОбъектыРасчетов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыАвансовКомитента</name>
    <attributes>
      <name>РасчетныйДокумент</name>
      <type>
        <types>DefinedType.ОснованиеСчетФактураВыданныйАванс</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерПлатежноРасчетногоДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПлатежноРасчетногоДокумента</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ezois_ka/oooezoiskaobmen/src/AccumulationRegisters/НДСЗаписиКнигиПокупок/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
//++ НЕ УТ


// Определяет показатели регистра.
// 
// Параметры:
//  Свойства - Структура - содержащая ключи СвойстваПоказателей, СвойстваРесурсов
//
// Возвращаемое значение:
//  Соответствие - Ключ - имя показателя.
//                 Значение - структура свойств показателя.
//
Функция Показатели(Свойства) Экспорт

	Показатели = Новый Соответствие;
	
	СвойстваПоказателей = Свойства.СвойстваПоказателей;
	СвойстваРесурсов = Свойства.СвойстваРесурсов;
	
	МассивРесурсов = Новый Массив;
	МассивРесурсов.Добавить(Новый Структура(СвойстваРесурсов, "НДСУпр", "ВалютаУпр"));
	МассивРесурсов.Добавить(Новый Структура(СвойстваРесурсов, "НДС", "ВалютаРегл"));
	
	Показатели.Вставить(Перечисления.ПоказателиАналитическихРегистров.СуммаНДС, Новый Структура(СвойстваПоказателей, МассивРесурсов));
	
	Возврат Показатели;
	
КонецФункции
//-- НЕ УТ

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы

// см. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт

	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "РегистрыНакопления.НДСЗаписиКнигиПокупок.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Версия = "2.5.22.159";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("de97bc49-9d7a-47a9-a0ec-a9afbf8c581f");
	Обработчик.Многопоточный = Истина;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "РегистрыНакопления.НДСЗаписиКнигиПокупок.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.Порядок = Перечисления.ПорядокОбработчиковОбновления.Некритичный;
	Обработчик.Комментарий = НСтр("ru = 'Заполняет реквизиты Номер счета-фактуры и Дата счета-фактуры регистра накопления НДС Покупки'");
	
	Читаемые = Новый Массив;
	Читаемые.Добавить(Метаданные.РегистрыНакопления.НДСЗаписиКнигиПокупок.ПолноеИмя());
	Читаемые.Добавить(Метаданные.РегистрыНакопления.НДСАвансыПолученные.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Документы.СчетФактураВыданный.ПолноеИмя());
	Обработчик.ЧитаемыеОбъекты = СтрСоединить(Читаемые, ",");
	
	Изменяемые = Новый Массив;
	Изменяемые.Добавить(Метаданные.РегистрыНакопления.НДСЗаписиКнигиПокупок.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");
	
КонецПроцедуры

// Параметры:
// 	Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяРегистра = "РегистрНакопления.НДСЗаписиКнигиПокупок";
	ПараметрыВыборки = Параметры.ПараметрыВыборки; // см. ОбновлениеИнформационнойБазы.ДополнительныеПараметрыВыборкиДанныхДляМногопоточнойОбработки
	ПараметрыВыборки.ПолныеИменаРегистров = ПолноеИмяРегистра;
	ПараметрыВыборки.ПоляУпорядочиванияПриРаботеПользователей.Добавить("Период УБЫВ");
	ПараметрыВыборки.ПоляУпорядочиванияПриОбработкеДанных.Добавить("Период УБЫВ");
	ПараметрыВыборки.СпособВыборки = ОбновлениеИнформационнойБазы.СпособВыборкиРегистраторыРегистра();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НДСЗаписиКнигиПокупок.Регистратор КАК Ссылка
	|ИЗ
	|	РегистрНакопления.НДСЗаписиКнигиПокупок КАК НДСЗаписиКнигиПокупок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.НДСАвансыПолученные КАК НДСАвансыПолученные
	|		ПО НДСЗаписиКнигиПокупок.Регистратор = НДСАвансыПолученные.Регистратор
	|			И НДСЗаписиКнигиПокупок.СчетФактура = НДСАвансыПолученные.ДокументОплаты
	|			И НДСЗаписиКнигиПокупок.СуммаБезНДС = НДСАвансыПолученные.СуммаБезНДС
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданный
	|		ПО (НДСАвансыПолученные.ДокументЗачетаАванса = СчетФактураВыданный.ДокументОснование)
	|			И (НЕ СчетФактураВыданный.Ссылка.Исправление)
	|			И (НЕ СчетФактураВыданный.Ссылка.Корректировочный)
	|			И (СчетФактураВыданный.Ссылка.Проведен)
	|ГДЕ
	|	НДСЗаписиКнигиПокупок.Период >= &Период
	|	И НДСЗаписиКнигиПокупок.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВычетНДССПолученногоАванса)
	|	И НЕ СчетФактураВыданный.Ссылка ЕСТЬ NULL
	|СГРУППИРОВАТЬ ПО
	|	НДСЗаписиКнигиПокупок.Регистратор
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(НДСЗаписиКнигиПокупок.НомерСчетаФактуры) = """"
	|";
	
	Запрос.УстановитьПараметр("Период", Дата(2026,1,1));
	
	Регистраторы = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	ОбновлениеИнформационнойБазы.ОтметитьРегистраторыКОбработке(Параметры, Регистраторы, ПолноеИмяРегистра);
	
КонецПроцедуры

// Обработчик обновления
// 
// Параметры:
// 	Параметры - См. ОбновлениеИнформационнойБазы.ДополнительныеПараметрыВыборкиДанныхДляМногопоточнойОбработки 
//
Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	МетаданныеРегистра = Метаданные.РегистрыНакопления.НДСЗаписиКнигиПокупок;
	ПолноеИмяРегистра = МетаданныеРегистра.ПолноеИмя();
	
	ОбновляемыеДанные = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);
	
	Если ОбновляемыеДанные.Количество() = 0 Тогда
		Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяРегистра);
		Возврат;
	КонецЕсли;
	
	СписокОписаний = Новый Массив;
	СписокОписаний.Добавить(НСтр("ru = 'Не удалось заполнить реквизиты Номер счета-фактуры и Дата счета-фактуры регистра накопления НДС Покупки"".'"));
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОбновляемыеДанные", ОбновляемыеДанные);
	Запрос.УстановитьПараметр("ВерсияКодовВидовОпераций", УчетНДСКлиентСервер.ВерсияКодовВидовОпераций(Дата(2026,1,1)));
	Запрос.УстановитьПараметр("Период", Дата(2026,1,1));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОбновляемыеДанные.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ОбновляемыеДанные
	|ИЗ
	|	&ОбновляемыеДанные КАК ОбновляемыеДанные
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НДСАвансыПолученныеЗачеты.Период КАК Период,
	|	НДСАвансыПолученныеЗачеты.Регистратор КАК Регистратор,
	|	НДСАвансыПолученныеЗачеты.Организация КАК Организация,
	|	НДСАвансыПолученныеЗачеты.Контрагент КАК Поставщик,
	|	НДСАвансыПолученныеЗачеты.ДокументОплаты КАК СчетФактура,
	|	ВЫБОР
	|		КОГДА НДСАвансыПолученныеЗачеты.Событие = ЗНАЧЕНИЕ(Перечисление.СобытияНДСАвансы.ВычетПриВозвратеАванса)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ВозвратАвансовПолученных)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.АвансыПолученные)
	|	КОНЕЦ КАК ВидЦенности,
	|	ВЫРАЗИТЬ(НДСАвансыПолученныеЗачеты.СтавкаНДС КАК Справочник.СтавкиНДС).ПеречислениеСтавкаНДС КАК СтавкаНДС,
	|	НЕОПРЕДЕЛЕНО КАК СчетУчетаНДС,
	|	НДСАвансыПолученныеЗачеты.Период КАК ДатаОплаты,
	|	НДСАвансыПолученныеЗачеты.ДокументОплаты КАК ДокументОплаты,
	|	ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПокупки.ПредъявленНДСКВычету) КАК Событие,
	|	НДСАвансыПолученныеЗачеты.Период КАК ДатаСобытия,
	|	ВЫБОР
	|		КОГДА НЕ НДСАвансыПолученныеЗачеты.ИсправленныйСчетФактура = ЗНАЧЕНИЕ(Документ.СчетФактураВыданныйАванс.ПустаяСсылка)
	|				И НАЧАЛОПЕРИОДА(НДСАвансыПолученныеЗачеты.Период, КВАРТАЛ) > НАЧАЛОПЕРИОДА(РеквизитыДокументаЗачетаОплаты.Дата, КВАРТАЛ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЗаписьДополнительногоЛиста,
	|	ВЫБОР
	|		КОГДА НЕ НДСАвансыПолученныеЗачеты.ИсправленныйСчетФактура = ЗНАЧЕНИЕ(Документ.СчетФактураВыданныйАванс.ПустаяСсылка)
	|				И НАЧАЛОПЕРИОДА(НДСАвансыПолученныеЗачеты.Период, КВАРТАЛ) > НАЧАЛОПЕРИОДА(РеквизитыДокументаЗачетаОплаты.Дата, КВАРТАЛ)
	|			ТОГДА РеквизитыДокументаЗачетаОплаты.Дата
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ КАК КорректируемыйПериод,
	|	НЕОПРЕДЕЛЕНО КАК ДоговорКонтрагента,
	|	НДСАвансыПолученныеЗачеты.ИсправленныйСчетФактура КАК ИсправленныйСчетФактура,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВычетНДССПолученногоАванса) КАК ХозяйственнаяОперация,
	|	ВЫБОР
	|		КОГДА НДСАвансыПолученныеЗачеты.Событие = ЗНАЧЕНИЕ(Перечисление.СобытияНДСАвансы.ВычетПриВозвратеАванса)
	|			ТОГДА РеквизитыДокументаЗачетаОплаты.Номер
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК НомерДокументаОплаты,
	|	ВЫБОР
	|		КОГДА НДСАвансыПолученныеЗачеты.Событие = ЗНАЧЕНИЕ(Перечисление.СобытияНДСАвансы.ВычетПриВозвратеАванса)
	|			ТОГДА РеквизитыДокументаЗачетаОплаты.Дата
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ДатаДокументаОплаты,
	|	ВЫБОР
	|		КОГДА &ВерсияКодовВидовОпераций >= 3
	|				И НДСАвансыПолученныеЗачеты.ИсправленныйСчетФактура.КодВидаОперации = ""26""
	|			ТОГДА ""26""
	|		КОГДА &ВерсияКодовВидовОпераций >= 3
	|				И ЕСТЬNULL(СчетФактураВыданныйАванс.Ссылка.КодВидаОперации, """") = ""26""
	|			ТОГДА ""26""
	|		ИНАЧЕ ""22""
	|	КОНЕЦ КАК КодВидаОперации,
	|	ИСТИНА КАК РегламентнаяОперация,
	|	НЕОПРЕДЕЛЕНО КАК ДокументОтгрузки,
	|	НЕОПРЕДЕЛЕНО КАК ВидДеятельностиНДС,
	|	"""" КАК КодОперации0,
	|	НДСАвансыПолученныеЗачеты.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	НДСАвансыПолученныеЗачеты.Сторно КАК Сторно,
	|	НЕОПРЕДЕЛЕНО КАК ПродавцомВыступаетОрганизация,
	|	НДСАвансыПолученныеЗачеты.ДокументЗачетаАванса КАК ДокументЗачетаАванса
	|ПОМЕСТИТЬ ВТ_ОсновныеДанные
	|ИЗ
	|	РегистрНакопления.НДСАвансыПолученные КАК НДСАвансыПолученныеЗачеты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбновляемыеДанные КАК ОбновляемыеДанные
	|		ПО НДСАвансыПолученныеЗачеты.Регистратор = ОбновляемыеДанные.Регистратор
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК РеквизитыДокументаЗачетаОплаты
	|		ПО НДСАвансыПолученныеЗачеты.Организация = РеквизитыДокументаЗачетаОплаты.Организация
	|			И НДСАвансыПолученныеЗачеты.ДокументЗачетаАванса = РеквизитыДокументаЗачетаОплаты.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданныйАванс КАК СчетФактураВыданныйАванс
	|		ПО НДСАвансыПолученныеЗачеты.Организация = СчетФактураВыданныйАванс.Организация
	|			И НДСАвансыПолученныеЗачеты.ДокументОплаты = СчетФактураВыданныйАванс.ДокументОснование
	|			И (ВЫБОР
	|				КОГДА ТИПЗНАЧЕНИЯ(НДСАвансыПолученныеЗачеты.ДокументОплаты) = ТИП(Документ.ВводОстатков)
	|					ТОГДА НДСАвансыПолученныеЗачеты.Контрагент = СчетФактураВыданныйАванс.Контрагент
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|ГДЕ
	|	НДСАвансыПолученныеЗачеты.Период >= &Период
	|	И НДСАвансыПолученныеЗачеты.НДС <> 0
	|
	|ИНДЕКСИРОВАТЬ ПО НАБОРАМ (
	|(Организация,
	|ДокументЗачетаАванса),
	|(ДокументЗачетаАванса))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ОсновныеДанные.Период КАК Период,
	|	ВТ_ОсновныеДанные.Регистратор КАК Регистратор,
	|	ВТ_ОсновныеДанные.Организация КАК Организация,
	|	ВТ_ОсновныеДанные.Поставщик КАК Поставщик,
	|	ВТ_ОсновныеДанные.СчетФактура КАК СчетФактура,
	|	ВТ_ОсновныеДанные.ВидЦенности КАК ВидЦенности,
	|	ВТ_ОсновныеДанные.СтавкаНДС КАК СтавкаНДС,
	|	ВТ_ОсновныеДанные.СчетУчетаНДС КАК СчетУчетаНДС,
	|	ВТ_ОсновныеДанные.ДатаОплаты КАК ДатаОплаты,
	|	ВТ_ОсновныеДанные.ДокументОплаты КАК ДокументОплаты,
	|	ВТ_ОсновныеДанные.Событие КАК Событие,
	|	ВТ_ОсновныеДанные.ДатаСобытия КАК ДатаСобытия,
	|	ВТ_ОсновныеДанные.ЗаписьДополнительногоЛиста КАК ЗаписьДополнительногоЛиста,
	|	ВТ_ОсновныеДанные.КорректируемыйПериод КАК КорректируемыйПериод,
	|	ВТ_ОсновныеДанные.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВТ_ОсновныеДанные.ИсправленныйСчетФактура КАК ИсправленныйСчетФактура,
	|	ВТ_ОсновныеДанные.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ВТ_ОсновныеДанные.НомерДокументаОплаты КАК НомерДокументаОплаты,
	|	ВТ_ОсновныеДанные.ДатаДокументаОплаты КАК ДатаДокументаОплаты,
	|	ВТ_ОсновныеДанные.КодВидаОперации КАК КодВидаОперации,
	|	ВТ_ОсновныеДанные.РегламентнаяОперация КАК РегламентнаяОперация,
	|	ВТ_ОсновныеДанные.ДокументОтгрузки КАК ДокументОтгрузки,
	|	ВТ_ОсновныеДанные.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|	ВТ_ОсновныеДанные.КодОперации0 КАК КодОперации0,
	|	ВТ_ОсновныеДанные.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ВТ_ОсновныеДанные.Сторно КАК Сторно,
	|	ВТ_ОсновныеДанные.ПродавцомВыступаетОрганизация КАК ПродавцомВыступаетОрганизация,
	|	ДанныеСчетаФактуры.НомерСчетаФактуры КАК НомерСчетаФактуры,
	|	ДанныеСчетаФактуры.ДатаСчетаФактуры КАК ДатаСчетаФактуры
	|ИЗ
	|	ВТ_ОсновныеДанные КАК ВТ_ОсновныеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданный
	|		ПО ВТ_ОсновныеДанные.ДокументЗачетаАванса = СчетФактураВыданный.ДокументОснование
	|			И (НЕ СчетФактураВыданный.Ссылка.Исправление)
	|			И (НЕ СчетФактураВыданный.Ссылка.Корректировочный)
	|			И (СчетФактураВыданный.Ссылка.Проведен)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналУчетаСчетовФактур КАК ДанныеСчетаФактуры
	|		ПО (СчетФактураВыданный.Ссылка.Организация = ДанныеСчетаФактуры.Организация)
	|			И (СчетФактураВыданный.Ссылка = ДанныеСчетаФактуры.СчетФактура)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ОсновныеДанные.Период,
	|	ВТ_ОсновныеДанные.Регистратор,
	|	ВТ_ОсновныеДанные.Организация,
	|	ВТ_ОсновныеДанные.Поставщик,
	|	ВТ_ОсновныеДанные.СчетФактура,
	|	ВТ_ОсновныеДанные.ВидЦенности,
	|	ВТ_ОсновныеДанные.СтавкаНДС,
	|	ВТ_ОсновныеДанные.СчетУчетаНДС,
	|	ВТ_ОсновныеДанные.ДатаОплаты,
	|	ВТ_ОсновныеДанные.ДокументОплаты,
	|	ВТ_ОсновныеДанные.Событие,
	|	ВТ_ОсновныеДанные.ДатаСобытия,
	|	ВТ_ОсновныеДанные.ЗаписьДополнительногоЛиста,
	|	ВТ_ОсновныеДанные.КорректируемыйПериод,
	|	ВТ_ОсновныеДанные.ДоговорКонтрагента,
	|	ВТ_ОсновныеДанные.ИсправленныйСчетФактура,
	|	ВТ_ОсновныеДанные.ХозяйственнаяОперация,
	|	ВТ_ОсновныеДанные.НомерДокументаОплаты,
	|	ВТ_ОсновныеДанные.ДатаДокументаОплаты,
	|	ВТ_ОсновныеДанные.КодВидаОперации,
	|	ВТ_ОсновныеДанные.РегламентнаяОперация,
	|	ВТ_ОсновныеДанные.ДокументОтгрузки,
	|	ВТ_ОсновныеДанные.ВидДеятельностиНДС,
	|	ВТ_ОсновныеДанные.КодОперации0,
	|	ВТ_ОсновныеДанные.НаправлениеДеятельности,
	|	ВТ_ОсновныеДанные.Сторно,
	|	ВТ_ОсновныеДанные.ПродавцомВыступаетОрганизация,
	|	ДанныеСчетаФактуры.НомерСчетаФактуры,
	|	ДанныеСчетаФактуры.ДатаСчетаФактуры
	|ИЗ
	|	ВТ_ОсновныеДанные КАК ВТ_ОсновныеДанные
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|	ПО
	|		ВТ_ОсновныеДанные.ДокументЗачетаАванса = СчетФактураВыданный.Ссылка
	|		И НЕ СчетФактураВыданный.Исправление
	|		И НЕ СчетФактураВыданный.Корректировочный
	|		И СчетФактураВыданный.Проведен
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналУчетаСчетовФактур КАК ДанныеСчетаФактуры
	|		ПО (СчетФактураВыданный.Организация = ДанныеСчетаФактуры.Организация)
	|			И (СчетФактураВыданный.Ссылка = ДанныеСчетаФактуры.СчетФактура)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ОсновныеДанные.Период,
	|	ВТ_ОсновныеДанные.Регистратор,
	|	ВТ_ОсновныеДанные.Организация,
	|	ВТ_ОсновныеДанные.Поставщик,
	|	ВТ_ОсновныеДанные.СчетФактура,
	|	ВТ_ОсновныеДанные.ВидЦенности,
	|	ВТ_ОсновныеДанные.СтавкаНДС,
	|	ВТ_ОсновныеДанные.СчетУчетаНДС,
	|	ВТ_ОсновныеДанные.ДатаОплаты,
	|	ВТ_ОсновныеДанные.ДокументОплаты,
	|	ВТ_ОсновныеДанные.Событие,
	|	ВТ_ОсновныеДанные.ДатаСобытия,
	|	ВТ_ОсновныеДанные.ЗаписьДополнительногоЛиста,
	|	ВТ_ОсновныеДанные.КорректируемыйПериод,
	|	ВТ_ОсновныеДанные.ДоговорКонтрагента,
	|	ВТ_ОсновныеДанные.ИсправленныйСчетФактура,
	|	ВТ_ОсновныеДанные.ХозяйственнаяОперация,
	|	ВТ_ОсновныеДанные.НомерДокументаОплаты,
	|	ВТ_ОсновныеДанные.ДатаДокументаОплаты,
	|	ВТ_ОсновныеДанные.КодВидаОперации,
	|	ВТ_ОсновныеДанные.РегламентнаяОперация,
	|	ВТ_ОсновныеДанные.ДокументОтгрузки,
	|	ВТ_ОсновныеДанные.ВидДеятельностиНДС,
	|	ВТ_ОсновныеДанные.КодОперации0,
	|	ВТ_ОсновныеДанные.НаправлениеДеятельности,
	|	ВТ_ОсновныеДанные.Сторно,
	|	ВТ_ОсновныеДанные.ПродавцомВыступаетОрганизация,
	|	ДанныеСчетаФактуры.НомерСчетаФактуры,
	|	ДанныеСчетаФактуры.ДатаСчетаФактуры
	|ИЗ
	|	ВТ_ОсновныеДанные КАК ВТ_ОсновныеДанные
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.КорректировкаРеализации КАК КорректировкаРеализации
	|	ПО
	|		ВТ_ОсновныеДанные.Организация = КорректировкаРеализации.Организация
	|		И ВТ_ОсновныеДанные.ДокументЗачетаАванса = КорректировкаРеализации.Ссылка
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданный
	|	ПО
	|		КорректировкаРеализации.ДокументОснование = СчетФактураВыданный.ДокументОснование
	|		И НЕ СчетФактураВыданный.Ссылка.Исправление
	|		И НЕ СчетФактураВыданный.Ссылка.Корректировочный
	|		И СчетФактураВыданный.Ссылка.Проведен
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналУчетаСчетовФактур КАК ДанныеСчетаФактуры
	|		ПО (СчетФактураВыданный.Ссылка.Организация = ДанныеСчетаФактуры.Организация)
	|			И (СчетФактураВыданный.Ссылка = ДанныеСчетаФактуры.СчетФактура)
	|	
	|ИТОГИ ПО
	|	Регистратор
	|";
	
	Результат = Запрос.Выполнить();
	РезультатРегистратор = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока РезультатРегистратор.Следующий() Цикл
		
		ПроблемныйРегистратор = РезультатРегистратор.Регистратор;
		ПричинаИсключения = "";
		Рекомендация = "";
		
		НачатьТранзакцию();
		
		ДетальныеЗаписи = РезультатРегистратор.Выбрать();

		Попытка
		
		ПричинаИсключения = "";
		Рекомендация = "";
		
		
		ПричинаИсключения = "Блокировка";
		
		Блокировка = Новый БлокировкаДанных;
		
		ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.НДСЗаписиКнигиПокупок.НаборЗаписей");
		ЭлементБлокировки.УстановитьЗначение("Регистратор", РезультатРегистратор.Регистратор);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		
		Блокировка.Заблокировать();
		
		ПричинаИсключения = "ПлохиеДанные";
		Рекомендация = НСтр("ru = 'Выполните вручную регламентную операция Формирование движений по НДС'");
		
		НаборЗаписей = РегистрыНакопления.НДСЗаписиКнигиПокупок.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(РезультатРегистратор.Регистратор);
		НаборЗаписей.Прочитать();
		
		// Удалим ранее сформированные записи по номерам СФ выданным.
		ЗаписиКУдалению = Новый Массив();
		Для Каждого Запись Из НаборЗаписей Цикл
			Если Запись.СуммаБезНДС = 0
				И Запись.НДС = 0
				И ЗначениеЗаполнено(Запись.НомерСчетаФактуры) Тогда
				
				ЗаписиКУдалению.Добавить(Запись);
				
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого Запись Из ЗаписиКУдалению Цикл
			НаборЗаписей.Удалить(Запись);
		КонецЦикла;
		
		Пока ДетальныеЗаписи.Следующий() Цикл
			
			Если ЗначениеЗаполнено(ДетальныеЗаписи.НомерСчетаФактуры) Тогда
				НоваяЗапись = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяЗапись, ДетальныеЗаписи);
			КонецЕсли;
			
		КонецЦикла;
			
		ПричинаИсключения = "Запись";
		Если НаборЗаписей.Модифицированность() Тогда
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
		Иначе
			ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(НаборЗаписей);
		КонецЕсли;
			
		ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			ОбновлениеИнформационнойБазыУТ.СообщитьОНеудачнойОбработке(ИнформацияОбОшибке(), ПроблемныйРегистратор);
			
			Если ПричинаИсключения = "ПлохиеДанные" Тогда
				
				ОбновлениеИнформационнойБазы.ЗарегистрироватьПроблемуСДанными(ПроблемныйРегистратор, Рекомендация, Параметры);
				
			ИначеЕсли ПричинаИсключения = "Запись" Тогда
				
				ВызватьИсключение СтрСоединить(СписокОписаний, Символы.ПС);
				
			КонецЕсли;
			
		КонецПопытки;
	
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяРегистра);

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
